export const Questions = {
  first: {
    contents: {
      0: "나는 부모님/친구/선생님 등 주변 사람들의 영향을 받아 학업에 대한 결정을 한다",
      1: "혼자 하는 프로젝트보다 여럿이서 역할을 분담해 함께하는 그룹워크가 더 즐겁다",
      2: "나는 혼자 공부하는 것 보다 친구와 함께 그룹 스터디를 하는게 더 효율적이다",
      3: "나는 가끔 강압적일지라도 해야 할 일을 하게끔 하는 제3자의 존재가 필요하다고 생각한다.",
      4: "나는 스파르타식 학습환경을 선호한다.",
      5: "나는 스스로가 계획한 일을 스스로 추진할 때 가장 능률이 좋다.",
    },
  },

  second: {
    contents: {
      6: "나는 결과보다 과정으로 평가 받는것을 선호한다. 따라서 점수로 평가 받는 시험보다, 부분점수를 받을 수 있는 과제가 편하다.",
      7: "나는 시험 또는 과제 제출을 앞두고 학습 계획을 철저하게 짜고, 해당 계획을 따르는 편이다.",
      8: "나는 계획한 일정대로 학습이 진행되지 않을경우 스트레스를 받는다.",
      9: "시험과 같은 평가방식은 나의 학습 이해도를 평가하기에 부족하다고 생각한다.",
      10: "나는 시간을 들여 나의 이해도와 리서치 정성을 평가받을 수 있는 과제를 할 때 보람을 느낀다.",
    },
  },
  third: {
    contents: {
      11: "나는 꼭 글 또는 다이어그램으로 이루어진 노트를 직접 만들면서 학습한다.",
      12: "글로써 정리된 자료가 그림으로 된 자료보다 이해하기 쉽다.",
      13: "나는 주관식 문제유형보다 객관식 문제유형을 선호한다.",
      14: "나는 그림 노트는 비효율적이라고 생각하며, 그림을 통해 이해하는 경우가 매우 드물다.",
      15: "나는 답이 정해진 문제풀이보다 다양한 주제와 해석이 있을 수 있는 에세이 또는 프로젝트를 선호한다.",
      16: "나는 전체를 이해하지 않고도 부분을 이해할 수 있다고 생각한다.",
      17: "나는 공부할 때 디테일을 이해하고 외우는 것이 어렵지 않다고 느낀다.",
      18: "근거를 드는 것이 우선이다. 의견은 근거가 있을 때 제시하는 것이 맞다.",
    },
  },
  fourth: {
    contents: {
      19: "내가 공감할 수 있는 일화적, 시각적 자료가 제시될 때 보다 이해하기 쉽다.",
      20: "개인적인 사정으로 기분이 좋지않을때는 공부를 하기 힘들다. 그날의 컨디션에 따라 공부 퀄리티가 결정된다.",
      21: "내가 못하는 부분을 잘 캐치해 꾸짖어 주는 선생님보다는, 작은것에도 하나하나 칭찬을 해주는 선생님이 더 나에게 도움이 된다.",
      22: "나는 못하는 과목 보다는 잘하는 과목에 시간 투자를 더 많이하는편이다.",
      23: "동기부여가 떨어지면 다시 원래 페이스를 되찾고 공부하기 힘들다.",
    },
  },
};

export const Results = {
  first: {
    title: "유형 1 : 학습동기",
    6: {
      type: "E",
      typeExp: "환경주도형",
      contents:
        "외부 환경의 영향을 많이 받는 학습스타일로 구조화된 환경, 명확한 지침과 보상체계를 선호합니다.\n\n스터디 그룹 가입해 비슷한 목표를 가진 친구들과 스터디 그룹을 만들어 함께 학습하세요. 이는 학습 동기를 부여하고, 서로를 격려할 수 있는 좋은 방법입니다.\n\n또한 선생님, 친구 등의 도움을 받아 구체적이고 달성 가능한 목표를 설정하세요. 목표 달성 과정에서의 진행 상황을 주기적으로 함께 검토하고 피드백 및 보상을 해주는 멘토의 존재는 학습 동기를 부여하고 경과를 추적하는 데 효과적입니다.",
      highlights:
        "학원선생님, 선배 등 멘토와 주기적으로 연락하며 학습 현황을 점검 받는게 좋습니다. EE/IA 진행시에도 슈퍼바이저와 꾸준한 면담을 통해 개인 연구 과제 플랜을 검토하고, 정기적으로 진행 현황을 알려야 합니다. IB 수업외에도 Extracurricular activity로 그룹 프로젝트를 진행하면 좋을 것 같습니다.",
    },
    12: {
      type: "E",
      typeExp: "환경주도형",
      contents:
        "자기 주도와 환경 주도 학습 스타일 사이에서 균형을 이루며, 다양한 학습 환경에 유연하게 적응합니다. 일부 지시와 지원이 필요하지만, 스스로 학습 계획을 세우고 이를 실행할 능력을 가지고 있습니다. 당일의 컨디션, 공부하는 내용에 따라 온라인 강의, 현장 강의, 독서, 토론 등 다양한 학습 방법을 시도하며 자신에게 가장 효과적인 방법을 찾습니다.\n\n멘토와 함께 학습 목표를 설정하되 학습 자료나 온라인 코스를 탐색하는 등 일부 학습 활동은 스스로 계획하고 실행하세요. 주기적으로 자신의 학습 방법과 진행 상황을 체크하여, 환기를 시켜야 할때마다 새로운 학습 방법을 택해주세요.\n\n목표를 친구나 가족과 공유하여 서로를 격려하고 지지받는 느낌을 받으세요. 이는 동기 부여를 증가시킬 수 있습니다.",
      highlights:
        "팀 과제가 가능한 과목을 선택하세요. 예를 들어 Psychology IA는 팀을 이루어 실험을 계획합니다. 6과목을 효율적으로 공부할 수 있는 과목별 스터디 플랜이 필요합니다. ",
    },
    18: {
      type: "S",
      typeExp: "자가주도형",
      contents:
        "자기 주도적 학습 경향이 있는 스타일. 주로 스스로 학습 계획을 세우고 실행하지만, 때때로 외부 조언이나 지원이 필요할 수 있습니다.\n스스\n로 장기 및 단기 학습 목표를 설정하고, 이를 달성하기 위한 개인 학습 계획을 수립하세요. 이때, 목표 달성을 위한 구체적인 단계를 포함시키세요. 스스로 성과를 평가하고 자기 피드백을 하는 데 도움이 됩니다.\n특히\n 자료 탐색이 중요한 유형으로 Past paper, 노트, 교과서, 영상 강의 등 다양한 학습 자료와 리소스를 탐색하여, 자신만의 학습 자료 라이브러리를 구축하세요. 이는 학습에 다양성을 더하고, 관심 분야를 깊게 탐구하는 데 도움이 됩니다.",
      highlights:
        "스스로 목표를 세우고 학습 계획을 실천해 왔다면 다음으로는 정기 스터디 그룹을 진행하여 다른 관점에서 Past paper와 실전 문제들을 알아보세요. 특히 Group 3 case study를 분석하는 작업에서 다양한 아이디어를 얻으며 인사이트를 디벨롭 하면 좋습니다. 다양한 IA/EE 샘플을 미리 확보하고 관심있는 주제에 따라 과목을 선정하세요.",
    },
    24: {
      type: "S",
      typeExp: "자가주도형",
      contents:
        "자기 주도 학습 스타일로 스스로 학습 목표를 설정하고, 계획을 세우며, 실행하는 데 능숙합니다. 새로운 학습 환경에도 잘 적응하며 독립적인 환경에서 탁월한 성과를 낼 수 있습니다.\n 독\n립적인 학습 프로젝트 (independent project)를 진행하세요. 관심사에 따라 주제를 선정하고 문헌연구, 사회/과학 실험, 설문조사 등을 활용해 학습/전공 관련 독립 프로젝트를 실행해보세요. 연구에 가까운 프로젝트가 아니어도 좋습니다. 하루에 5시간 공부, 노트 2권 쓰기, 시험에서 7점 맞기 등 자신만의 프로젝트를 기획하고 실행하세요. 실제 적용을 통한 학습은 이해도를 높이고, 실력을 실제로 발휘할 수 있는 기회를 제공합니다. \n자기\n 의존적인 학습자일지라도 정기적으로 학습 방법과 경과를 진단하는 과정은 필요합니다. 최소 1-2달에 한 번은 목표한 바를 계획한 대로 잘 실행했는지, 개선할 점은 무엇이 있는지 스스로를 되돌아보세요. 주기적인 스터디 그룹보다는 관련 분야의 선생님 또는 전문가와 네트워킹을 통해 지식을 공유하고, 새로운 관점을 얻는 것을 추천 이는 학습을 넘어 성장하는 데 중요한 역할을 합니다.",
      highlights:
        "주어진 커리큘럼을 바탕으로 관심 주제를 더 깊게 탐구하여 EE 또는 IA 작성 시 차별화를 둘 수 있습니다. EE 또는 IA Peer Feedback을 꼭 받아보세요. 모든 과정을 독립적으로 수행하면 분명 미흡한 부분이 다른 사람의 관점을 통해 드러날 수 있습니다.",
    },
  },
  second: {
    title: "유형 2 : 학습방법",
    5: {
      type: "I",
      typeExp: "결과 중심, 즉흥형",
      contents:
        "결과 중심적이고 즉흥적인 스타일로 목표 달성을 위한 빠른 결과와 보상에 집중하는 경향이 있습니다. 즉흥적인 결정을 선호하고 임기응변에 능하며 계획보다는 실행에 더 무게를 둡니다.\n\n달성가능한 단기 목표를 설정하고, 목표를 달성할 때마다 즉각적인 보상을 받을 수 있는 체계를 마련합니다.\n\n학습목표 달성을 위한 경쟁적인 환경을 조성하여 동기를 부여하는것도 좋습니다 (올림피아드, 대회 참여 및 시험 점수 경쟁 등).\n\n실용적 학습 자료 활용하면 좋은 유형으로 실제 사례 연구나 실생활 문제 해결을 위한 학습 자료를 활용하여 학습의 실용성을 높입니다.",
      highlights:
        "DP Core의 Creativity, Activity, Service (CAS) 중 동기부여가 될 만한 정기적인 활동을 설정해주세요.",
    },
    10: {
      type: "I",
      typeExp: "결과 중심, 즉흥형",
      contents:
        "혼합형 학습 스타일로, 계획과 즉흥 사이에서 균형을 이룹니다. 결과뿐만 아니라 과정에도 일정 부분 가치를 두며, 다양한 학습 방식에 유연하게 적응할 수 있습니다. \n\n프로젝트 기반의 과정 build up이 중요하지만 결과 또한 확실한 과제에서 두각을 나타냅니다. 중기 목표를 설정하고, 이를 달성하기 위한 계획을 세웁니다. 동시에, 즉흥적인 학습 활동도 일부 포함시킵니다.",
      highlights:
        "장기적으로 실행할 수 있는 EE 및 IA 연구 프로젝트를 추천하며 시험대비를 병행하기 위한 구체적인 소프트 데드라인을 설정해주세요.",
    },
    15: {
      type: "P",
      typeExp: "과정 중심, 계획형",
      contents:
        "과정중심적이면서 계획적인 스타일로 학습 과정의 이해와 체계적인 계획을 중시합니다. 장기적인 목표 설정과 단계별 접근을 선호합니다.\n\n개인 또는 그룹 프로젝트를 통해 특정 주제에 대한 심도 있는 탐구를 장려합니다. 여러 달 혹은 해에 걸쳐 프로젝트 간의 유기성을 제고하는 것도 학습 과정에 대한 이해와 흥미를 높일 수 있습니다.\n\n원리와 개념에 대한 이해: 학습하는 주제의 기본 원리와 개념을 깊이 이해하는 데 중점을 둡니다. 이를 통해 지식의 근본적인 이해를 도모합니다.",
      highlights:
        "이콘, 비즈니스 등 case study를 깔끔하게 분석하는게 중요한 과목이 유리한 학생입니다. Language subject도 Literature의 장편 문학을 장기적으로 심도있게 부분부분 분석하는게 더 좋겠습니다. IB 6과목의 개념 이해와 탐구도 물론 중요하지만 IA / EE / TOK 등 과제를 완성하기 위한 시간을 충분히 확보해야 합니다.",
    },
    20: {
      type: "P",
      typeExp: "과정 중심, 계획형",
      contents:
        "학습 결과보다는 과정에 더 큰 의미를 두며 계획을 매우 중요시 여기는 타입으로, 학습 과정과 원리의 깊은 이해, 그리고 장기적인 계획과 목표 달성에 큰 가치를 둡니다. \n\n연구형에 가까운 학습 유형이므로 관심 있는 주제에 대해 자기 주도적인 리서치 프로젝트를 수행하는 것이 권장됩니다. 이는 학습에 대한 깊은 통찰력과 만족감을 제공합니다.\n\n 학습내용의 원리와 이론에 깊이 파고들어, 근본적인 이해를 추구합니다. 복잡한 문제들을 원리적으로 접근하는 연습을 하여 본인만의 알고리즘을 발굴하는 것이 중요합니다.",
      highlights:
        "본인의 관심 탐구 주제와 페이스대로 진행할 수 있는 TOK 개인 발표를 추천합니다. EE 과목으로는 본인이 실험을 디자인하고 결과를 리포팅 할 수 있는 과학 과목 또는 장편 문학작품을 분석 할 수 있는 언어 과목을 추천합니다. 예체능을 하는 학생이라면 DP 과정에 걸쳐 수준 높은 포트폴리오를 완성할 수 있을 것 같습니다.",
    },
  },
  third: {
    title: "유형 3 : 개념화 유형",
    7: {
      type: "C",
      typeExp: "총체적 창의형",
      contents:
        "창의형, 비주얼형, 문과적 학습 스타일로 매우 총체적이고 숲을 보는 학습 스타일입니다. 시각적 자료와 창의적 접근을 선호합니다. 이 유형의 학생은 답이 열려있는 문제를 해결하며 아이디어를 시각화하는 것을 좋아합니다. 매우 전체적인 관점을 중시하며, 개별적인 디테일보다는 큰 그림에서의 이해를 추구합니다.\n\n개념을 시각화하기 위해 다양한 색상과 형태를 사용한 노트 필기, 마인드 맵 생성, 인포그래픽이나 차트 활용을 권장합니다. 학습 자료를 스토리텔링의 형태로 구성하여, 내용을 더욱 흥미롭고 기억에 남게 합니다. 이야기를 통해 복잡한 개념을 설명하고, 학습자의 창의력을 자극합니다.\n\n새로운 학습 주제에 접근할 때, 가장 먼저 전체 구조와 주요 개념을 파악합니다. 학습의 목적과 주제가 어떻게 서로 연결되어 있는지 이해하는 것에 중점을 둡니다.\n\n서로 다른 분야의 지식을 결합하여 새로운 통찰력을 얻는것도 긍정적으로 작용할 수 있습니다. 관련된 다양한 주제에 대한 학습을 통해 유연한 사고 방식을 개발하고, 보다 넓은 관점에서 세상을 바라볼 수 있도록 합니다.",
      highlights:
        "추천 문과 과목: 역사, 심리, 정치 (Group 3 에서 과목 2개 추천) / 추천 이과 과목: 생물 \n6과목을 통해 배운 원리와 이론을 DP Core 에 잘 적용시켜 학습 내용에 대한 관점을 넓힐 수 있습니다.",
    },
    14: {
      type: "C",
      typeExp: "총체적 창의형",
      contents:
        "혼합형 학습 스타일로 이론과 실제, 시각적 자료와 문서화된 정보를 모두 활용하여 학습하는 균형 잡힌 접근 방식을 선호합니다. 또, 전체적인 그림을 중시하면서도 중요한 세부 사항에도 주의를 기울입니다.\n\n텍스트 기반의 자료와 시각적 자료를 균형 있게 활용하여, 학습의 다양성과 효과를 극대화합니다. 예컨대, 강의 노트와 함께 관련 비디오나 애니메이션을 시청합니다.\n\n이론적 배경을 학습한 후, 실습을 통해 해당 이론을 적용해 보는 활동을 포함시킵니다. 이를 통해 이론과 실제 사이의 연결을 강화합니다. 또한 넓은 범위의 주제를 테마별로 분류하고, 각 테마 내에서 중요한 개념과 세부 사항을 탐색하여 구조적으로 접근하는 것이 효율적입니다. 이때, 복잡한 정보와 개념을 시각적으로 표현하는 도구(예: 마인드 맵, 개념도)를 활용하여, 전체적인 구조와 세부 사항 간의 관계를 명확히 합니다.",
      highlights:
        "추천 문과 과목: 지오그래피, 비즈니스 / 추천 이과 과목: 생물\n추천 과목으로는 경제가 있으며 포괄적인 경제 이념들의 흐름과 특징을 이해하는 것에 더불어 다양한 경제 구조와 주체가 미치는 영향을 분석합니다.",
    },
    21: {
      type: "D",
      typeExp: "디테일 집중형",
      contents:
        "계획적, 이론형 이과적 학습 스타일로 체계적인 접근과 이론적 배경을 중시합니다. 구조화된 정보와 논리적 사고를 선호합니다. 또, 세부적인 분석과 함께 전체적인 맥락을 이해하려는 경향이 있습니다.\n\n논리적 사고와 문제 해결 능력을 개발하기 위해, 관련 연습 문제나 케이스 스터디를 활용합니다. 문제의 원인을 분석하고, 가능한 해결책을 논리적으로 도출하는 연습을 합니다.\n\n학습 초기에 주제의 전체 구조와 중요한 개념을 파악한 후, 관련 세부 사항을 깊이 파고들며 이 두 가지 접근법을 균형 있게 적용합니다. 예를 들어, 각 세부 주제에 대해 빠르게 개요를 작성한 다음, 각각에 대해 더 깊은 분석을 수행합니다.\n\n학습 내용 간의 연결 고리를 찾아내어 이해의 네트워크를 구축합니다. 이는 정보를 기억하고 추후에 적용하는 데 도움이 됩니다. 서로 다른 주제나 개념이 어떻게 상호 작용하는지 탐색합니다.\n\n이 유형의 학생들은 명확한 과제 / 평가 방식: 객관식 시험, 수학적 문제 해결, 논리적 추론을 평가하는 과제가 적합합니다. 답이 정해져 있는 문제와 이론적 지식을 평가하는 시험이 더 적합합니다.",
      highlights:
        "추천 이과 과목: 생물, 화학 (Double Science), 수학 AA (HL) / 추천 문과 과목: 경제 \nHands-on 경험을 제공하는 과학 과목 추천; Biology와 Chemistry 같이 관련성 높은 과목들을 동시에 공부하므로서 본인의 전문성을 키워 나갈 수 있습니다.",
    },
    28: {
      type: "D",
      typeExp: "디테일 집중형",
      contents:
        "순수 이론형 이과적 학습 스타일. 고도로 계획적이고, 이론적 분석을 선호합니다. 복잡한 이론적 개념과 원리를 깊이 파고들기를 좋아합니다. 또, 매우 세부적인 정보에 주목하고, 이를 통해 깊이 있는 학습을 추구합니다.\n\n학습한 이론과 관련된 복잡한 이론적 개념과 원리를 깊이 있게 탐구합니다. 전문적인 학술 자료와 연구 논문을 활용하여, 학문적 깊이를 더합니다. \n\n데이터 분석, 통계적 방법론, 수학적 모델링 등을 활용하여 분석적 사고 능력을 강화합니다. 이를 통해 문제를 정확하게 분석하고, 해결 방안을 모색합니다.\n\n학습 내용을 논리적인 구조로 정리하고, 이를 바탕으로 학습합니다. 개념맵이나 플로우 차트를 활용할 수 있습니다.",
      highlights:
        "추천 이과 과목: 물리, 컴퓨터사이언스 (Double Science), 수학 AI (HL), / 추천 문과 과목: 경제\n\n 더불어 책 읽는 것을 좋아한다면 English Language & Literature HL 과정 추천; 다양한 문학적 형태와 비문학적 유형의 spoken 및 written-text에 대한 깊은 분석을 요구합니다.",
    },
  },
  fourth: {
    title: "유형 4 : 행동 조절",
    5: {
      type: "T",
      typeExp: "이성형",
      contents:
        "이 범위의 학생들은 감정보다는 이성과 논리를 중시하여 학습합니다. \n때로\n는 너무 이성적인 접근이 창의성이나 통찰력을 제한할 수 있습니다. \n고정\n된 사고에서 벗어나 다양한 관점에서 문제를 바라보려는 연습을 하면 다방면에서 더욱 좋은 결과를 낼 수 있을 겁니다. 또한 창의적 사고를 촉진하기 위한 활동에 참여하는 것을 추천합니다. 예를 들어, 예술 활동이나 다양한 사람들과의 협력을 통해 다양한 감정과 생각을 경험하고, 이를 통해 보다 균형 잡힌 사고 방식을 개발할 수 있습니다. ",
      highlights:
        "Group 4 과학 과목, 수학 등 정해진 답이 명확한 과목들에 강점을 보이며, 문과과목 또는 TOK 등의 에세이를 작성할때는 주제보다는 구성에 힘을 쓰는 전략을 추천합니다.",
    },
    10: {
      type: "T",
      typeExp: "이성형",
      contents:
        "이 범위의 학생들은 마인드 컨트롤이 가장 중요한 유형으로 대체로 이성적으로 문제를 접근하지만, 때때로 감정적인 반응을 보일 수 있습니다. 따라서 문제를 해결할 때 논리적이고 체계적인 접근을 하도록 연습하고, 감정이 학습에 끼치는 영향을 최소화하기 위해 감정을 조절하는 방법을 배우고 실천하는게 중요합니다. 무엇보다 꾸준하게 학습 계획을 실천하는 습관을 길러야합니다.",
      highlights: "",
    },
    15: {
      type: "F",
      typeExp: "감정형",
      contents:
        "이 범위의 학생들은 감정적으로 반응할 수 있지만, 일정 수준 이성적인 접근도 가능합니다. IA, EE 등의 장시간이 소요되는 과제를 할때 본인의 컨디션에 맞춰 업무 분배를 해놓는 훈련이 중요합니다. 또한 자신이 어떤 감정을 느끼는지 인식하고, 이것이 학습에 어떻게 영향을 미치는지 파악합니다.\n\n스트레스가 학습에 미치는 영향을 최소화하기 위해 정기적으로 운동을 하거나 취미 활동에 참여합니다. 단기적이고 달성 가능한 학습 목표를 설정하여 동기를 유지하고, 감정적 기복을 관리합니다.",
      highlights: "",
    },
    20: {
      type: "F",
      typeExp: "감정형",
      contents:
        "이 범위의 학생들은 감정의 영향을 많이 받으며, 학습 시 감정의 기복이 학습 효율에 큰 영향을 미칠 수 있습니다. \n\n학습 전과 중간중간에 명상이나 깊은 호흡 운동을 실시하여 감정을 진정시키고 집중력을 높일 피요가 있습니다. 학습 내용을 자신의 감정이나 경험과 연결지어 이해하려고 노력합니다. 이는 학습 내용의 흥미와 기억에 도움이 됩니다. Philosophy, Language and Literature, Art, Music 등 공감능력이 중요하며, 자기의 생각과 주관 그리고 창의력을 표출할 수 있는 과목에서 강점을 보일 수 있습니다. ",
      highlights: "",
    },
  },
};
