const RefundPolicy = () => {
  return (
    <>
      <main className="width_content min_content polic">
        <div className="header_tit_wrap tit_center">
          <h2>환불 규정</h2>
        </div>

        <div className="polic_content">
          <strong>환불 요청 조건:</strong>
          <br />
          <br />
          ① 서비스 불만족: 구독 서비스에 만족하지 못하셨다면, 구독 시작 후 7일
          이내에 환불을 요청할 수 있습니다.
          <br />
          ② 기술적 문제: 서비스 이용 중 기술적 문제로 인해 정상적인 사용이
          불가능한 경우, 문제 해결을 위해 최선을 다하겠습니다. 해결되지 않는
          경우 환불 요청이 가능합니다. <br />
          ③ 중대한 서비스 변경: 구독 기간 중 서비스 내용에 중대한 변경이 있을
          경우, 이에 동의하지 않으시면 환불을 요청할 수 있습니다.
          <br />
          <br />
          <strong>환불 절차:</strong>
          ① 환불 요청: 고객 지원 센터로 연락하여 환불 요청서를 제출해 주세요.
          이메일 또는 고객 지원 포털을 통해 요청할 수 있습니다. <br />
          ② 검토: 환불 요청이 접수되면, 요청 사유를 검토한 후 7일 이내에 처리
          결과를 알려드립니다. <br />
          ③ 환불 처리: 환불 요청이 승인되면, 결제 수단에 따라 5-10 영업일 이내에
          환불이 처리됩니다.
          <br />
          <br />
          <strong>환불 금액:</strong>① 월간 구독: 구독 시작 후 7일 이내에 요청된
          경우 전액 환불됩니다. <br />
          ② 분기/반기/연간 구독: <br />
          * 구독 시작 후 14일 이내에 요청된 경우 전액 환불됩니다. <br />
          * 14일 이후에 요청된 경우, 남은 기간에 대해 비례 환불이 진행됩니다.
          이미 사용한 1:1 튜터링 세션의 경우, 회당 비용이 차감되어 환불 금액이
          산정됩니다.
          <br />
          <br />
          <strong>환불 예외:</strong>
          * 구독 시작 후 7일 이후에 요청된 월간 구독 환불은 불가능합니다. <br />
          * 1:1 튜터링 세션이 이미 1회 이상 사용된 경우, 남은 기간에 상관없이
          환불이 불가능합니다. <br />
          * 특정 프로모션을 통해 할인된 구독 서비스의 경우, 별도의 환불 정책이
          적용될 수 있습니다.
          <br />
          <br />
          <strong>강의서비스 : 서비스 제공 기간</strong>
          <strong>월간 구독</strong>
          <br />
          * 제공 기간: 1개월 <br />
          * 혜택: 1:1 튜터링 6회 (Basic) / 12회 (Super) ,자료실 past paper 열람,
          영상 강의 2과목 (Basic) / 무제한 (Super) 시청 <br />
          <br />
          <strong>분기별 구독</strong>
          <br />
          * 제공 기간: 3개월 <br />
          * 할인 혜택: 월간 구독 대비 5% 할인 <br />
          <strong>반기별 구독</strong>
          <br />
          * 제공 기간: 6개월 <br />
          * 할인 혜택: 월간 구독 대비 10% 할인 <br />
          <strong>연간 구독</strong>
          <br />
          * 제공 기간: 12개월 <br />
          * 할인 혜택: 월간 구독 대비 15% 할인
          <br />
          <br />
        </div>
      </main>
    </>
  );
};

export default RefundPolicy;
